---
type: ViewDisplayModel
namespace: Autodesk.Revit.DB
version: 2024
members: 7
tags: [revit-api, class]
---

# ViewDisplayModel

`Autodesk.Revit.DB.ViewDisplayModel` · Revit 2024 · 7 members

| Kind | Member | Since | Signature |
| --- | --- | --- | --- |
| Method | Dispose | — | `public void Dispose ()` |
| Property | EnableSilhouettes | 2015 | `public bool EnableSilhouettes { get ; set ; }` |
| Property | IsValidObject | 2014 | `public bool IsValidObject { get ; }` |
| Property | ShowHiddenLines | 2015 | `public ShowHiddenLinesValues ShowHiddenLines { get ; set ; }` |
| Property | SilhouetteEdgesGStyleId | 2015 | `public ElementId SilhouetteEdgesGStyleId { get ; set ; }` |
| Property | SmoothEdges | 2015 | `public bool SmoothEdges { get ; set ; }` |
| Property | Transparency | 2015 | `public int Transparency { get ; set ; }` |